Data Wrangling

In [16]:
import pandas as pd 
import numpy as np
import seaborn as sns

In [3]:
kashti = sns.load_dataset('titanic')
ks1 = kashti
ks1 = kashti

In [4]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
# simple operation (math operator)
(kashti['age']+1).head(10)

0    23.0
1    39.0
2    27.0
3    36.0
4    36.0
5     NaN
6    55.0
7     3.0
8    28.0
9    15.0
Name: age, dtype: float64

Dealing with missing values

. N/A ,NaN,0,blank cell.

In [6]:
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
kashti.dropna(subset=['deck'],axis=0,inplace=True)
kashti.shape

(203, 15)

In [8]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [9]:
kashti=kashti.dropna()
kashti=kashti.dropna().isnull().sum()

In [10]:
kashti.isnull().sum()

0

In [11]:
kashti.shape

(15,)

Replacing the missing value with the average of that column

In [12]:
ks1.shape

(203, 15)

In [13]:
ks1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [14]:
# finding the average (maen)
age_mean = ks1['age'].mean()
age_mean

35.77945652173913

In [17]:
ks1['age'] = ks1['age'].replace(np.nan,age_mean)

In [18]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [20]:
ks1.dropna(subset=['embarked'],axis=0,inplace=True)

In [22]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [23]:
ks1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [26]:
ks1['survived']=ks1['survived'].astype('float64')
ks1.dtypes

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [27]:
ks1['age'] = ks1['age']*365

In [28]:
ks1.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,13870.00000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,12775.00000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,19710.00000,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,1460.00000,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,21170.00000,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1.0,2,male,12410.00000,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1.0,1,male,10220.00000,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0.0,1,male,6935.00000,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1.0,1,female,13059.50163,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1.0,1,female,17885.00000,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False

In [30]:
ks1.rename(columns={'age':'age in days'},inplace=True)
ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

# Normalization

In [33]:
ks4 = ks1[['age in days','fare']]
ks4.head()

    age in days     fare
1       13870.0  71.2833
3       12775.0  53.1000
6       19710.0  51.8625
10       1460.0  16.7000
11      21170.0  26.5500

In [35]:
#simple feature scaling
ks4['fare'] = ks4['fare']/ks4['fare'].max()
ks4.head()

C:\Users\ANZAR AZIZ\AppData\Local\Temp\ipykernel_15096\1832173846.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['fare'] = ks4['fare']/ks4['fare'].max()

    age in days      fare
1       13870.0  0.139136
3       12775.0  0.103644
6       19710.0  0.101229
10       1460.0  0.032596
11      21170.0  0.051822

In [36]:
# min max method
ks4['age in days'] = (ks4['age in days']-ks4['age in days'].min()) / (ks4['age in days'].max()-ks4['age in days'].min())
ks4.head()

C:\Users\ANZAR AZIZ\AppData\Local\Temp\ipykernel_15096\3942442446.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['age in days'] = (ks4['age in days']-ks4['age in days'].min()) / (ks4['age in days'].max()-ks4['age in days'].min())

    age in days      fare
1      0.468892  0.139136
3      0.430956  0.103644
6      0.671219  0.101229
10     0.038948  0.032596
11     0.721801  0.051822

In [38]:
pd.get_dummies(kashti['sex'])

   0
0  1